{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"U_regularizer": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "batch_input_shape": [null, 64, 95], "consume_less": "cpu", "dropout_U": 0.0, "dropout_W": 0.0, "forget_bias_init": "one", "go_backwards": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "input_dim": 95, "input_dtype": "float32", "input_length": null, "name": "lstm_1", "output_dim": 512, "return_sequences": true, "stateful": false, "trainable": true, "unroll": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "consume_less": "cpu", "dropout_U": 0.0, "dropout_W": 0.0, "forget_bias_init": "one", "go_backwards": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "input_dim": 512, "input_length": null, "name": "lstm_2", "output_dim": 512, "return_sequences": true, "stateful": false, "trainable": true, "unroll": false}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "consume_less": "cpu", "dropout_U": 0.0, "dropout_W": 0.0, "forget_bias_init": "one", "go_backwards": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "input_dim": 512, "input_length": null, "name": "lstm_3", "output_dim": 512, "return_sequences": false, "stateful": false, "trainable": true, "unroll": false}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 512, "name": "dense_1", "output_dim": 95, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "keras_version": "1.2.2"}